src/Catalogs/УчетныеЗаписиМаркетплейсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Catalog>
		<Properties>
			<Name>УчетныеЗаписиМаркетплейсов</Name>
			<Hierarchical>false</Hierarchical>
			<HierarchyType>HierarchyFoldersAndItems</HierarchyType>
		</Properties>
		<ChildObjects>
			<Attribute>
				<Properties>
					<Name>ВидМаркетплейса</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ВидыМаркетплейсов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Организация</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Организации</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКлиента</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИсточникКатегории</Name>
					<Type>
						<v8:Type>cfg:EnumRef.ИсточникиКатегорийДляМаркетплейса</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ВалютаУчета</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Валюты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ХешНастроек</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>36</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>НеОбновлятьДанныеТорговойПлощадки</Name>
					<Type>
						<v8:Type>xs:boolean</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Партнер</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Контрагент</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>Соглашение</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.СоглашенияСКлиентами</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорПродажиЧерезСкладыТорговойПлощадки</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ДоговорПродажиЧерезСкладыСобственные</Name>
					<Type>
						<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторМагазина</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторАккаунта</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>СхемаРаботы</Name>
					<Type>
						<v8:Type>cfg:EnumRef.СхемыРаботыТорговыхПлощадок</v8:Type>
					</Type>
				</Properties>
			</Attribute>
			<Attribute>
				<Properties>
					<Name>ИдентификаторКабинета</Name>
					<Type>
						<v8:Type>xs:string</v8:Type>
						<v8:StringQualifiers>
							<v8:Length>50</v8:Length>
						</v8:StringQualifiers>
					</Type>
				</Properties>
			</Attribute>
			<TabularSection>
				<Properties>
					<Name>ВидыЦен</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИмяНастройки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ВидЦены</Name>
							<Type>
								<v8:Type>cfg:CatalogRef.ВидыЦен</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
			<TabularSection>
				<Properties>
					<Name>ДополнительныеНастройки</Name>
				</Properties>
				<ChildObjects>
					<Attribute>
						<Properties>
							<Name>ИдентификаторНастройки</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>150</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеНастройки</Name>
							<Type>
								<v8:Type>xs:boolean</v8:Type>
								<v8:Type>xs:dateTime</v8:Type>
								<v8:Type>xs:decimal</v8:Type>
								<v8:NumberQualifiers>
									<v8:Digits>20</v8:Digits>
									<v8:FractionDigits>2</v8:FractionDigits>
								</v8:NumberQualifiers>
								<v8:DateQualifiers>
									<v8:DateFractions>DateTime</v8:DateFractions>
								</v8:DateQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеНастройкиСтрока</Name>
							<Type>
								<v8:Type>xs:string</v8:Type>
								<v8:StringQualifiers>
									<v8:Length>0</v8:Length>
								</v8:StringQualifiers>
							</Type>
						</Properties>
					</Attribute>
					<Attribute>
						<Properties>
							<Name>ЗначениеНастройкиСсылка</Name>
							<Comment>Состав типов реквизита дополняется по мере необходимости</Comment>
							<Type>
								<v8:Type>cfg:CatalogRef.Номенклатура</v8:Type>
								<v8:Type>cfg:CatalogRef.ДоговорыКонтрагентов</v8:Type>
								<v8:Type>cfg:CatalogRef.СоглашенияСКлиентами</v8:Type>
								<v8:Type>cfg:CatalogRef.Контрагенты</v8:Type>
								<v8:Type>cfg:CatalogRef.Партнеры</v8:Type>
								<v8:Type>cfg:CatalogRef.Склады</v8:Type>
							</Type>
						</Properties>
					</Attribute>
				</ChildObjects>
			</TabularSection>
		</ChildObjects>
	</Catalog>
</MetaDataObject>

src/Enums/ВидыМаркетплейсов.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>ВидыМаркетплейсов</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>МаркетплейсЯндексМаркет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>МаркетплейсOzon</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/СхемыРаботыТорговыхПлощадок.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СхемыРаботыТорговыхПлощадок</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>FBO</Name>
					<Comment>Хранение и доставка силами торговой площадки</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>FBS</Name>
					<Comment>Доставка силами торговой площадки</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>DBS</Name>
					<Comment>Хранение и доставка силами продавца</Comment>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>Express</Name>
					<Comment>Исполнение заказа в сжатые сроки</Comment>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Enums/СпособыЗаданияЦен.xml
<?xml version="1.0" encoding="UTF-8"?>
<MetaDataObject version="2.20">
	<Enum>
		<Properties>
			<Name>СпособыЗаданияЦен</Name>
		</Properties>
		<ChildObjects>
			<EnumValue>
				<Properties>
					<Name>Вручную</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаполнятьПоДаннымИБ</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>РассчитыватьПоФормуламОтДругихВидовЦен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаполнятьПоДаннымИБПриПоступлении</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаценкаНаЦенуПоступления</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаценкаНаЦенуВводаОстатков</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>НаценкаНаДругойВидЦен</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаполнятьПоДаннымИБПоСебестоимости</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаполнятьПоДаннымИБПоПоставщикам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗаполнятьПоДаннымИБПоКонкурентам</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагружаетсяИзЯндексМаркет</Name>
				</Properties>
			</EnumValue>
			<EnumValue>
				<Properties>
					<Name>ЗагружаетсяСOzon</Name>
				</Properties>
			</EnumValue>
		</ChildObjects>
	</Enum>
</MetaDataObject>

src/Catalogs/УчетныеЗаписиМаркетплейсов/Ext/ManagerModule.bsl
#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область ПрограммныйИнтерфейс

// Возвращает хеш настроек для переданной структуры настроек.
//
// Параметры:
//   СтруктураНастроек - Структура - структура с ключами настроек: 
//     * ВидМаркетплейса      - ПеречислениеСсылка.ВидыМаркетплейсов - вид маркетплейса для получения учетной записи;
//     * Организация          - СправочникСсылка.Организации - организация;
//     * ИдентификаторКлиента - Строка - идентификатор клиента маркетплейса;
//     * ИсточникКатегории    - ПеречислениеСсылка.ИсточникиКатегорийДляМаркетплейса - источник категорий;
//     * ВалютаУчета          - СправочникСсылка.Валюты - валюта учета;
//     * ВидыЦен              - ТаблицаЗначений - используемые виды цен:
//       ** ИмяНастройки        - Строка - имя настройки;
//       ** ВидЦены             - СправочникСсылка.ВидыЦен - вид цены.
// 
// Возвращаемое значение:
//   Строка - строковое представление хеш суммы.
//
Функция ПолучитьХешНастроек(СтруктураНастроек) Экспорт
	
	Возврат ИнтеграцияСМаркетплейсомOzonСервер.ПолучитьХешСтроки(ЗначениеВСтрокуВнутр(СтруктураНастроек));
	
КонецФункции

// Возвращает хеш настроек для учетной записи.
//
// Параметры:
//   УчетнаяЗаписьМаркетплейса - СправочникСсылка.УчетныеЗаписиМаркетплейсов - учетная запись, для которой необходимо вернуть хеш настроек.
// 
// Возвращаемое значение:
//   Строка - строковое представление хеш суммы.
//
Функция ПолучитьХешНастроекПоСсылке(УчетнаяЗаписьМаркетплейса) Экспорт 
	
	Если Не ЗначениеЗаполнено(УчетнаяЗаписьМаркетплейса) Тогда 
		Возврат Неопределено;
	КонецЕсли;	
	
	СтруктураНастроек = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(УчетнаяЗаписьМаркетплейса, СтрокаИменНастроекУчетнойЗаписи());
	
	СтруктураНастроек.Вставить("ВидыЦен",                 СтруктураНастроек.ВидыЦен.Выгрузить());
	СтруктураНастроек.Вставить("ДополнительныеНастройки", СтруктураНастроек.ДополнительныеНастройки.Выгрузить());
	
	Возврат ПолучитьХешНастроек(СтруктураНастроек);
	
КонецФункции

// Возвращает доступную учетную запись в случае, если она является единственной в справочнике.
// В случае отсутствия записей или наличия более одной возвращается пустая ссылка.
//
// Параметры:
//   ВидМаркетплейса - ПеречислениеСсылка.ВидыМаркетплейсов - вид маркетплейса для получения учетной записи.
//
// Возвращаемое значение:
//   СправочникСсылка.УчетныеЗаписиМаркетплейсов - учетная запись по-умолчанию.
//
Функция ОсновнаяУчетнаяЗапись(ВидМаркетплейса) Экспорт

	Запрос = Новый Запрос;
	Запрос.Текст =
		"ВЫБРАТЬ РАЗРЕШЕННЫЕ ПЕРВЫЕ 2
		|	УчетныеЗаписиМаркетплейсов.Ссылка КАК Ссылка
		|ИЗ
		|	Справочник.УчетныеЗаписиМаркетплейсов КАК УчетныеЗаписиМаркетплейсов
		|ГДЕ
		|	УчетныеЗаписиМаркетплейсов.ВидМаркетплейса = &ВидМаркетплейса
		|	И УчетныеЗаписиМаркетплейсов.ПометкаУдаления = ЛОЖЬ";
	
	Запрос.УстановитьПараметр("ВидМаркетплейса", ВидМаркетплейса);
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат ПредопределенноеЗначение("Справочник.УчетныеЗаписиМаркетплейсов.ПустаяСсылка");
	КонецЕсли;

	Выборка = Результат.Выбрать();
	Если Выборка.Количество() = 2 Тогда
		Возврат ПредопределенноеЗначение("Справочник.УчетныеЗаписиМаркетплейсов.ПустаяСсылка");
	КонецЕсли;

	Выборка.Следующий();
	Возврат Выборка.Ссылка;

КонецФункции

// Возвращает структуру с настройками учетной записи.
//
// Параметры:
//   УчетнаяЗаписьМаркетплейса - СправочникСсылка.УчетныеЗаписиМаркетплейсов - учетная запись для получения настроек.
//   ТолькоОсновные            - Булево - признак получения только значений основных реквизитов учетной записи.
// 
// Возвращаемое значение:
//   Структура - настройки учетной записи из СтрокаИменНастроекУчетнойЗаписи() и иные настройки:
//     * ВидМаркетплейса                           - ПеречислениеСсылка.ВидыМаркетплейсов - вид маркетплейса;
//     * Организация                               - СправочникСсылка.Организации - организация;
//     * ИдентификаторКлиента                      - Строка - идентификатор клиента;
//     * ИсточникКатегории                         - ПеречислениеСсылка.ИсточникиКатегорийДляМаркетплейса - источник категории;
//     * ВалютаУчета                               - СправочникСсылка.Валюты - валюта учета;
//     * ВидыЦен                                   - Структура - используемые виды цен, где ключ - имя настройки, значение - вид цены;
//     * СхемаРаботы                               - ПеречислениеСсылка.СхемыРаботыТорговыхПлощадок - схема работы;
//     * Партнер                                   - СправочникСсылка.Партнеры - партнер;
//     * Контрагент                                - СправочникСсылка.Контрагенты - контрагент;
//     * Соглашение                                - СправочникСсылка.СоглашенияСКлиентами - соглашение;
//     * ДоговорПродажиЧерезСкладыТорговойПлощадки - СправочникСсылка.ДоговорыКонтрагентов - договор продажи через склады торговой площадки;
//     * ДоговорПродажиЧерезСкладыСобственные      - СправочникСсылка.ДоговорыКонтрагентов - договор продажи через склады собственные;
//     * ПродажиРазделяютсяПоДоговорам             - Булево - признак разделения продаж со складов торговой площадки и собственных складов;
//     * ДополнительныеНастройки                   - Соответствие Из КлючИЗначение - настройки из табличной части ДополнительныеНастройки,
//                                                     см. ОписаниеДополнительныхНастроекУчетнойЗаписи().
//
Функция НастройкиУчетнойЗаписи(УчетнаяЗаписьМаркетплейса, ТолькоОсновные = Ложь) Экспорт

	ЗначенияНастроек = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(УчетнаяЗаписьМаркетплейса, СтрокаИменНастроекУчетнойЗаписи());

	ЗначенияНастроек.Вставить("ПродажиРазделяютсяПоДоговорам",
		ЗначенияНастроек.ДоговорПродажиЧерезСкладыТорговойПлощадки <> ЗначенияНастроек.ДоговорПродажиЧерезСкладыСобственные);

	ВидыЦен = Новый Структура;
	ДополнительныеНастройки = Новый Структура;

	Если Не ТолькоОсновные Тогда
		ОписаниеВидовЦен = ОписаниеВидовЦенУчетнойЗаписи(ЗначенияНастроек.ВидМаркетплейса);

		Для Каждого ОписаниеВидаЦен Из ОписаниеВидовЦен Цикл
			ВидыЦен.Вставить(ОписаниеВидаЦен.Ключ, ПредопределенноеЗначение("Справочник.ВидыЦен.ПустаяСсылка"));
		КонецЦикла;

		Если ЗначенияНастроек.ВидыЦен <> Неопределено Тогда
			Выборка = ЗначенияНастроек.ВидыЦен.Выбрать();
			Пока Выборка.Следующий() Цикл
				Если ВидыЦен.Свойство(Выборка.ИмяНастройки) Тогда
					ВидыЦен[Выборка.ИмяНастройки] = Выборка.ВидЦены;
				КонецЕсли;
			КонецЦикла;
		КонецЕсли;

		ДополнительныеНастройки = ОписаниеДополнительныхНастроекУчетнойЗаписи(УчетнаяЗаписьМаркетплейса);
	КонецЕсли;

	ЗначенияНастроек.ВидыЦен = ВидыЦен;
	ЗначенияНастроек.Вставить("ДополнительныеНастройки", ДополнительныеНастройки);

	Возврат ЗначенияНастроек;

КонецФункции

// Возвращает для учетной записи признак доступности работы с остатками на торговой площадке.
//
// Параметры:
//   УчетнаяЗаписьМаркетплейса - СправочникСсылка.УчетныеЗаписиМаркетплейсов - учетная запись для получения настроек.
// 
// Возвращаемое значение:
//   Булево - признак доступности работы с остатками на торговой площадке.
//
Функция ДоступнаРаботаСОстаткамиДляУчетнойЗаписи(УчетнаяЗаписьМаркетплейса) Экспорт

	РеквизитыУчетнойЗаписи = ОбщегоНазначения.ЗначенияРеквизитовОбъекта(УчетнаяЗаписьМаркетплейса, "ВидМаркетплейса, СхемаРаботы");

	Возврат ДоступнаРаботаСОстатками(РеквизитыУчетнойЗаписи.ВидМаркетплейса, РеквизитыУчетнойЗаписи.СхемаРаботы);

КонецФункции

// Возвращает для схемы работы признак доступности работы с остатками на торговой площадке по виду маркетплейса.
//
// Параметры:
//   ВидМаркетплейса - ПеречислениеСсылка.ВидыМаркетплейсов           - вид маркетплейса для проверки признака;
//   СхемаРаботы     - ПеречислениеСсылка.СхемыРаботыТорговыхПлощадок - схема работы для проверки признака.
// 
// Возвращаемое значение:
//   Булево - признак доступности работы с остатками на торговой площадке.
//
Функция ДоступнаРаботаСОстатками(ВидМаркетплейса, СхемаРаботы) Экспорт

	ДоступнаРаботаСОстатками = Ложь;

	Если ВидМаркетплейса = ПредопределенноеЗначение("Перечисление.ВидыМаркетплейсов.МаркетплейсOzon") Тогда
		ДоступнаРаботаСОстатками = (СхемаРаботы = ПредопределенноеЗначение("Перечисление.СхемыРаботыТорговыхПлощадок.FBS")
			Или СхемаРаботы = ПредопределенноеЗначение("Перечисление.СхемыРаботыТорговыхПлощадок.DBS"));
	ИначеЕсли ВидМаркетплейса = ПредопределенноеЗначение("Перечисление.ВидыМаркетплейсов.МаркетплейсЯндексМаркет") Тогда
		ДоступнаРаботаСОстатками = (СхемаРаботы = ПредопределенноеЗначение("Перечисление.СхемыРаботыТорговыхПлощадок.FBS")
			Или СхемаРаботы = ПредопределенноеЗначение("Перечисление.СхемыРаботыТорговыхПлощадок.Express"));
	КонецЕсли;

	Возврат ДоступнаРаботаСОстатками;

КонецФункции

// Возвращает информацию по видам цен учетной записи.
//
// Параметры:
//   УчетнаяЗаписьМаркетплейса - СправочникСсылка.УчетныеЗаписиМаркетплейсов - учетная запись, для которой необходимо вернуть хеш настроек.
// 
// Возвращаемое значение:
//   Структура - ключом является идентификатор вида цены на маркетплейсе, значением информация по виду цены.
//
Функция ВидыЦенУчетнойЗаписи(УчетнаяЗаписьМаркетплейса) Экспорт

	ВидыЦенУчетнойЗаписи = Новый Структура;
	
	НастройкиУчетнойЗаписи = НастройкиУчетнойЗаписи(УчетнаяЗаписьМаркетплейса);
	ВидыЦен = НастройкиУчетнойЗаписи.ВидыЦен;
	ОписаниеВидовЦен = ОписаниеВидовЦенУчетнойЗаписи(НастройкиУчетнойЗаписи.ВидМаркетплейса);

	Для Каждого ДанныеВидаЦен Из ВидыЦен Цикл
		ОписаниеВидаЦен = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ОписаниеВидовЦен, ДанныеВидаЦен.Ключ, Неопределено);
		ТребуетсяПроверкаЗаполнения = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ОписаниеВидаЦен, "ПроверкаЗаполнения", Ложь);
		ПредставлениеВидаЦены = ОбщегоНазначенияКлиентСервер.СвойствоСтруктуры(ОписаниеВидаЦен, "ПредставлениеВидаЦены", "");

		СтруктураДанныхВидаЦен = Новый Структура;
		СтруктураДанныхВидаЦен.Вставить("ВидЦены", ДанныеВидаЦен.Значение);
		СтруктураДанныхВидаЦен.Вставить("ПроверкаЗаполнения", ТребуетсяПроверкаЗаполнения);
		СтруктураДанныхВидаЦен.Вставить("ПредставлениеВидаЦены", ПредставлениеВидаЦены);

		ВидыЦенУчетнойЗаписи.Вставить(ДанныеВидаЦен.Ключ, СтруктураДанныхВидаЦен);
	КонецЦикла;

	Возврат ВидыЦенУчетнойЗаписи;

КонецФункции

#Область ДляВызоваИзДругихПодсистем

// СтандартныеПодсистемы.УправлениеДоступом

// Позволяет указать объекты метаданных, для которых задана логика ограничения доступа к данным.
//
// Параметры:
//   Ограничение - см. УправлениеДоступомПереопределяемый.ПриЗаполненииОграниченияДоступа.Ограничение.
//
Процедура ПриЗаполненииОграниченияДоступа(Ограничение) Экспорт

	Ограничение.Текст =
		"РазрешитьЧтениеИзменение
		|ГДЕ
		|	ЗначениеРазрешено(Организация)";

КонецПроцедуры

// Конец СтандартныеПодсистемы.УправлениеДоступом

#КонецОбласти

#КонецОбласти

#КонецЕсли

#Область ОбработчикиСобытий

Процедура ОбработкаПолученияПолейПредставления(Поля, СтандартнаяОбработка)
	
	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		СтандартнаяОбработка = Ложь;
		
		Поля.Добавить("Ссылка");
		Поля.Добавить("ВидМаркетплейса");
		Поля.Добавить("Наименование");
		Поля.Добавить("СхемаРаботы");
		Поля.Добавить("ИдентификаторКлиента");
	#КонецЕсли
								
КонецПроцедуры

Процедура ОбработкаПолученияПредставления(Данные, Представление, СтандартнаяОбработка)

	#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда
		СтандартнаяОбработка = Ложь;
		Представление        = Данные.Наименование;
		
		Если Данные.ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.МаркетплейсЯндексМаркет Тогда
			ПредставлениеСхемыРаботы = Перечисления.СхемыРаботыТорговыхПлощадок.ПредставлениеСхемыРаботы(Данные.СхемаРаботы, Данные.Ссылка);

			Представление = Представление
							+ ?(ЗначениеЗаполнено(Данные.СхемаРаботы), ", " + ПредставлениеСхемыРаботы, "")
							+ ?(ЗначениеЗаполнено(Данные.ИдентификаторКлиента),
								" " + СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(НСтр("ru = '(номер магазина: %1)'"), Данные.ИдентификаторКлиента),
								"");
		КонецЕсли;
	#КонецЕсли

КонецПроцедуры

#КонецОбласти

#Если Сервер Или ТолстыйКлиентОбычноеПриложение Или ВнешнееСоединение Тогда

#Область СлужебныеПроцедурыИФункции

// Возвращает структуру с именами видов цен и признаком проверки заполнения цены.
//
// Возвращаемое значение:
//  Структура - где ключ - имя настройки с видом цен, значение - структура с ключами:
//								ПредставлениеВидаЦены - Строка - представление вида цены в форме настроек синхронизации,
//								ПроверкаЗаполнения - Булево - признак необходимости проверки заполнения цены.
//
Функция ОписаниеВидовЦенУчетнойЗаписи(ВидМаркетплейса)

	ОписаниеВидовЦен = Новый Структура;
	
	Если ВидМаркетплейса = ПредопределенноеЗначение("Перечисление.ВидыМаркетплейсов.МаркетплейсOzon")
		Или Не ЗначениеЗаполнено(ВидМаркетплейса) Тогда

		ТипыЦен = ИнтеграцияСМаркетплейсамиСерверЛокализация.ТипыЦенOzon(Истина, Ложь);
		Для Каждого ТипЦен Из ТипыЦен Цикл
			ДанныеВидаЦены = Новый Структура("ПредставлениеВидаЦены, ПроверкаЗаполнения",
					ТипЦен.Наименование, ТипЦен.ОбязательноеЗаполнение);
			ОписаниеВидовЦен.Вставить(ТипЦен.Идентификатор, ДанныеВидаЦены);
		КонецЦикла;
		
	КонецЕсли;

	Возврат ОписаниеВидовЦен;

КонецФункции

// Возвращает соответствие с идентификаторами настроек и их значениями.
//
// Параметры:
//   УчетнаяЗаписьМаркетплейса - СправочникСсылка.УчетныеЗаписиМаркетплейсов - учетная запись подключения к сервису.
//
// Возвращаемое значение:
//   Соответствие Из КлючИЗначение - где ключ - идентификатор настройки, значение - произвольное значение, ограниченное 
//     типом реквизитов Справочники.УчетныеЗаписиМаркетплейсов.ТабличныеЧасти.ДополнительныеНастройки.ЗначениеНастройки
//     и Справочники.УчетныеЗаписиМаркетплейсов.ТабличныеЧасти.ДополнительныеНастройки.ЗначениеНастройкиСтрока.
//
Функция ОписаниеДополнительныхНастроекУчетнойЗаписи(УчетнаяЗаписьМаркетплейса) Экспорт

	ОписаниеНастроек = Новый Соответствие;
	
	Если ЗначениеЗаполнено(УчетнаяЗаписьМаркетплейса) Тогда
		ДополнительныеНастройки = ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УчетнаяЗаписьМаркетплейса, "ДополнительныеНастройки");	// РезультатЗапроса
		ВыборкаНастроек = ДополнительныеНастройки.Выбрать();	// ВыборкаИзРезультатаЗапроса
		Пока ВыборкаНастроек.Следующий() Цикл
			Если ЗначениеЗаполнено(ВыборкаНастроек.ЗначениеНастройкиСсылка) Тогда
				ЗначениеНастройки = ВыборкаНастроек.ЗначениеНастройкиСсылка
			ИначеЕсли Не ПустаяСтрока(ВыборкаНастроек.ЗначениеНастройкиСтрока) Тогда
				ЗначениеНастройки = ВыборкаНастроек.ЗначениеНастройкиСтрока;
			Иначе
				ЗначениеНастройки = ВыборкаНастроек.ЗначениеНастройки;
			КонецЕсли;

			ОписаниеНастроек.Вставить(ВыборкаНастроек.ИдентификаторНастройки, ЗначениеНастройки);
		КонецЦикла;
	КонецЕсли;

	Возврат ОписаниеНастроек;

КонецФункции

// Возвращает список реквизитов настроек учетной записи маркетплейса.
//
// Возвращаемое значение:
//   Строка - список реквизитов, разделенных символом ",".
//
Функция СтрокаИменНастроекУчетнойЗаписи()
	
	СтрокаИменНастроекУчетнойЗаписи =
		"ВидМаркетплейса, Организация, ИдентификаторКлиента, ИсточникКатегории, ВалютаУчета, ВидыЦен, СхемаРаботы,
		|Партнер, Контрагент, Соглашение, ДоговорПродажиЧерезСкладыТорговойПлощадки, ДоговорПродажиЧерезСкладыСобственные, ДополнительныеНастройки";
		
	Возврат СтрокаИменНастроекУчетнойЗаписи;
	
КонецФункции

// Возвращает виды цен учетных записей маркетплейсов.
// 
// Параметры:
//   ВидМаркетплейса - ПеречислениеСсылка.ВидыМаркетплейсов - вид маркетплейса.
// 
// Возвращаемое значение:
//   Массив Из СправочникСсылка.ВидыЦен - список видов цен учетных записей маркетплейса Ozon.
//
Функция ВидыЦенУчетныхЗаписейМаркетплейса(ВидМаркетплейса) Экспорт

	Запрос = Новый Запрос;  
	Запрос.Текст =
    	"ВЫБРАТЬ РАЗРЕШЕННЫЕ РАЗЛИЧНЫЕ
    	|	ВидыЦенУчетныхЗаписей.ВидЦены КАК ВидЦены
    	|ИЗ
    	|	Справочник.УчетныеЗаписиМаркетплейсов.ВидыЦен КАК ВидыЦенУчетныхЗаписей
    	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.УчетныеЗаписиМаркетплейсов КАК УчетныеЗаписиМаркетплейсов
    	|		ПО ВидыЦенУчетныхЗаписей.Ссылка = УчетныеЗаписиМаркетплейсов.Ссылка
    	|		ВНУТРЕННЕЕ СОЕДИНЕНИЕ Справочник.ВидыЦен КАК СправочникВидыЦен
    	|		ПО (СправочникВидыЦен.Ссылка = ВидыЦенУчетныхЗаписей.ВидЦены)
    	|ГДЕ
    	|	НЕ УчетныеЗаписиМаркетплейсов.ПометкаУдаления
    	|	И УчетныеЗаписиМаркетплейсов.ВидМаркетплейса = &ВидМаркетплейса
    	|	И НЕ ВидыЦенУчетныхЗаписей.ВидЦены = ЗНАЧЕНИЕ(Справочник.УчетныеЗаписиМаркетплейсов.ПустаяСсылка)
    	|	И НЕ СправочникВидыЦен.ПометкаУдаления
    	|
    	|ОБЪЕДИНИТЬ ВСЕ
    	|
    	|ВЫБРАТЬ РАЗЛИЧНЫЕ
    	|	ВидыЦен.Ссылка
    	|ИЗ
    	|	Справочник.ВидыЦен КАК ВидыЦен
    	|		ЛЕВОЕ СОЕДИНЕНИЕ Справочник.УчетныеЗаписиМаркетплейсов.ВидыЦен КАК ВидыЦенУчетныхЗаписей
    	|		ПО ВидыЦен.Ссылка = ВидыЦенУчетныхЗаписей.ВидЦены
    	|ГДЕ
    	|	НЕ ВидыЦен.ПометкаУдаления
    	|	И ВидыЦен.СпособЗаданияЦены = &СпособЗаданияЦены
    	|	И ВидыЦенУчетныхЗаписей.ВидЦены ЕСТЬ NULL";  
		 
	Если ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.МаркетплейсOzon Тогда 
		СпособЗаданияЦены = Перечисления.СпособыЗаданияЦен.ЗагружаетсяСOzon;		
	ИначеЕсли ВидМаркетплейса = Перечисления.ВидыМаркетплейсов.МаркетплейсЯндексМаркет Тогда 
		СпособЗаданияЦены = Перечисления.СпособыЗаданияЦен.ЗагружаетсяИзЯндексМаркет;
	Иначе
		СпособЗаданияЦены = Перечисления.СпособыЗаданияЦен.ПустаяСсылка();
	КонецЕсли; 
	Запрос.Параметры.Вставить("ВидМаркетплейса",ВидМаркетплейса);
	Запрос.Параметры.Вставить("СпособЗаданияЦены",СпособЗаданияЦены);
	
	Результат = Запрос.Выполнить();
	Если Результат.Пустой() Тогда
		Возврат Новый Массив;
	КонецЕсли;

	Выгрузка = Результат.Выгрузить();
	Возврат Выгрузка.ВыгрузитьКолонку("ВидЦены");

КонецФункции

// Возвращает количество подключений к площадке маркетплейса.
//
// Параметры:
//   ВидМаркетплейса - ПеречислениеСсылка.ВидыМаркетплейсов - вид маркетплейса.
// 
// Возвращаемое значение:
//   Число - количество подключений.
//
Функция ПолучитьКоличествоПодключений(ВидМаркетплейса) Экспорт

	Запрос = Новый Запрос;
	Запрос.УстановитьПараметр("ВидМаркетплейса", ВидМаркетплейса);
	Запрос.Текст =
    	"ВЫБРАТЬ
    	|	ЕСТЬNULL(КОЛИЧЕСТВО(РАЗЛИЧНЫЕ УчетныеЗаписиМаркетплейсов.Ссылка), 0) КАК КоличествоПодключений
    	|ИЗ
    	|	Справочник.УчетныеЗаписиМаркетплейсов КАК УчетныеЗаписиМаркетплейсов
    	|ГДЕ
    	|	НЕ УчетныеЗаписиМаркетплейсов.ПометкаУдаления
    	|	И УчетныеЗаписиМаркетплейсов.ВидМаркетплейса = &ВидМаркетплейса";

	РезультатЗапроса = Запрос.Выполнить();

	ВыборкаДетальныеЗаписи = РезультатЗапроса.Выбрать();
	ВыборкаДетальныеЗаписи.Следующий();

	Возврат ВыборкаДетальныеЗаписи.КоличествоПодключений;

КонецФункции

// Изменяет признак контроля обновления данных торговой площадки.
//
// Параметры:
//   УчетнаяЗаписьМаркетплейса         - СправочникСсылка.УчетныеЗаписиМаркетплейсов - учетная запись подключения к сервису.
//	 НеОбновлятьДанныеТорговойПлощадки - Булево - Истина, если необходимо запретить обновление данных торговой площадки.
// 
// Возвращаемое значение:
//   Булево - результат выполнения действия.
//
Функция ИзменитьКонтрольОбновленияДанныхТорговойПлощадки(УчетнаяЗаписьМаркетплейса, НеОбновлятьДанныеТорговойПлощадки) Экспорт

	Результат = Истина;
	
	Если ЗначениеЗаполнено(УчетнаяЗаписьМаркетплейса) Тогда
		НачатьТранзакцию();
		
		Попытка
			БлокировкаДанных = Новый БлокировкаДанных;
			ЭлементБлокировкиДанных = БлокировкаДанных.Добавить("Справочник.УчетныеЗаписиМаркетплейсов");
			ЭлементБлокировкиДанных.УстановитьЗначение("Ссылка", УчетнаяЗаписьМаркетплейса);
			БлокировкаДанных.Заблокировать();
			
			Объект = УчетнаяЗаписьМаркетплейса.ПолучитьОбъект();
			Если Объект = Неопределено Тогда 
				Результат = Ложь;
				
			Иначе
				ЗаблокироватьДанныеДляРедактирования(УчетнаяЗаписьМаркетплейса);
				
				Объект.НеОбновлятьДанныеТорговойПлощадки = НеОбновлятьДанныеТорговойПлощадки;
				Объект.Записать();
			КонецЕсли;
                
            ЗафиксироватьТранзакцию();

		Исключение   
			ОтменитьТранзакцию();
			Результат = Ложь;
			
			ШаблонСообщения = НСтр("ru = 'Ошибка изменения контроля обновления данных торговой площадки по причине: %1'");
			ТекстСообщения = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонСообщения, ОбработкаОшибок.ПодробноеПредставлениеОшибки(ИнформацияОбОшибке()));
			ОбщегоНазначения.СообщитьПользователю(ТекстСообщения);
		КонецПопытки;
	КонецЕсли;
	
	Возврат Результат;

КонецФункции

// Возвращает признак контроля обновления данных торговой площадки.
//
// Параметры:
//   УчетнаяЗаписьМаркетплейса - СправочникСсылка.УчетныеЗаписиМаркетплейсов - учетная запись подключения к сервису.
// 
// Возвращаемое значение:
//   Булево - Истина, если обновление данных торговой площадки разрешено;
//		      Ложь - обновление данных запрещено.
//
Функция ОбновленияДанныхТорговойПлощадкиРазрешено(УчетнаяЗаписьМаркетплейса) Экспорт
	
	Если Не ЗначениеЗаполнено(УчетнаяЗаписьМаркетплейса) Тогда
		Возврат Ложь;
	КонецЕсли;
	
	УстановитьПривилегированныйРежим(Истина);
	Результат = Не ОбщегоНазначения.ЗначениеРеквизитаОбъекта(УчетнаяЗаписьМаркетплейса, "НеОбновлятьДанныеТорговойПлощадки");
	УстановитьПривилегированныйРежим(Ложь);
	
	Возврат Результат;
	
КонецФункции

#Область РаботаСРегламентнымиЗаданиями

// Удаляет регламентное задание по переданному ключу.
//
// Параметры:
//   Ключ - Строка - Ключ регламентного задания.
//
Процедура УдалитьРегламентноеЗадание(Ключ) Экспорт

	Отбор = Новый Структура("Ключ", Ключ);
	РезультатПоиска = РегламентныеЗаданияСервер.НайтиЗадания(Отбор);
	Для Каждого РегламентноеЗадание Из РезультатПоиска Цикл
		РегламентныеЗаданияСервер.УдалитьЗадание(РегламентноеЗадание);
	КонецЦикла;

КонецПроцедуры

// Изменяет использование регламентного задания.
//
// Параметры:
//   Ключ           - Строка - ключ регламентного задания.
//   Использование  - Булево - признак использования, который нужно установить регламентному заданию, если оно не удаляется.
//
Процедура УстановитьИспользованиеРегламентногоЗадания(Ключ, Использование) Экспорт

	Отбор = Новый Структура("Ключ, Использование", Ключ, НЕ Использование);

	РезультатПоиска = РегламентныеЗаданияСервер.НайтиЗадания(Отбор);
	Для Каждого РегламентноеЗадание Из РезультатПоиска Цикл
		Параметры = Новый Структура();
		Параметры.Вставить("Использование", Использование);
		РегламентныеЗаданияСервер.ИзменитьЗадание(РегламентноеЗадание, Параметры);
	КонецЦикла;

КонецПроцедуры

// Изменяет наименование регламентного задания.
//
// Параметры:
//   Ключ                              - Строка - ключ регламентного задания.
//   ПредставлениеРегламентногоЗадания - Строка - представление регламентного задания
//                                                для формирования наименования регламентного задания.
//   ПредставлениеУчетнойЗаписи        - Строка - представление учетной записи 
//                                                для формирования наименования регламентного задания.
//
Процедура УстановитьНаименованиеРегламентногоЗадания(Ключ, ПредставлениеРегламентногоЗадания, ПредставлениеУчетнойЗаписи) Экспорт

	ШаблонНаименования = "%1 (%2)";
	НаименованиеРегЗадания = СтроковыеФункцииКлиентСервер.ПодставитьПараметрыВСтроку(ШаблонНаименования,
		ПредставлениеРегламентногоЗадания,
		ПредставлениеУчетнойЗаписи);

	Отбор = Новый Структура("Ключ", Ключ);
	РезультатПоиска = РегламентныеЗаданияСервер.НайтиЗадания(Отбор);
	Для Каждого РегламентноеЗадание Из РезультатПоиска Цикл
		Параметры = Новый Структура();
		Параметры.Вставить("Наименование", НаименованиеРегЗадания);
		РегламентныеЗаданияСервер.ИзменитьЗадание(РегламентноеЗадание, Параметры);
	КонецЦикла;

КонецПроцедуры

#КонецОбласти

#КонецОбласти

#КонецЕсли
